Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_a.h
extern void TIMER_A_initContinuousMode(uint16_t baseAddress,
                                       TIMER_A_initContinuousModeParam *param);

extern void TIMER_A_initUpMode(uint16_t baseAddress,
                               TIMER_A_initUpModeParam *param);

extern void TIMER_A_initUpDownMode(uint16_t baseAddress,
                                   TIMER_A_initUpDownModeParam *param);

extern void TIMER_A_initCaptureMode(uint16_t baseAddress,
                                    TIMER_A_initCaptureModeParam *param);

extern void TIMER_A_initCompareMode(uint16_t baseAddress,
                                    TIMER_A_initCompareModeParam *param);

extern void TIMER_A_enableInterrupt(uint16_t baseAddress);

extern void TIMER_A_disableInterrupt(uint16_t baseAddress);

extern uint32_t TIMER_A_getInterruptStatus(uint16_t baseAddress);

extern void TIMER_A_enableCaptureCompareInterrupt(uint16_t baseAddress,
                                                  uint16_t captureCompareRegister);

extern void TIMER_A_disableCaptureCompareInterrupt(uint16_t baseAddress,
                                                   uint16_t captureCompareRegister);

extern uint32_t TIMER_A_getCaptureCompareInterruptStatus(uint16_t baseAddress,
                                                         uint16_t captureCompareRegister,
                                                         uint16_t mask);

extern void TIMER_A_clear(uint16_t baseAddress);

extern uint8_t TIMER_A_getSynchronizedCaptureCompareInput(uint16_t baseAddress,
                                                          uint16_t captureCompareRegister,
                                                          uint16_t synchronized);

extern uint8_t TIMER_A_getOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                                         uint16_t captureCompareRegister);

extern uint16_t TIMER_A_getCaptureCompareCount(uint16_t baseAddress,
                                               uint16_t captureCompareRegister);

extern void TIMER_A_setOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                                      uint16_t captureCompareRegister,
                                                      uint8_t outputModeOutBitValue);

extern void TIMER_A_outputPWM(uint16_t baseAddress,
                              TIMER_A_outputPWMParam *param);

extern void TIMER_A_stop(uint16_t baseAddress);

extern void TIMER_A_setCompareValue(uint16_t baseAddress,
                                    uint16_t compareRegister,
                                    uint16_t compareValue);

extern void TIMER_A_clearTimerInterruptFlag(uint16_t baseAddress);

extern void TIMER_A_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                                     uint16_t captureCompareRegister);

extern uint16_t TIMER_A_getCounterValue(uint16_t baseAddress);

//*****************************************************************************
//
// The following are deprecated APIs.
//
//*****************************************************************************
extern void TIMER_A_configureContinuousMode(uint16_t baseAddress,
                                            uint16_t clockSource,
                                            uint16_t clockSourceDivider,
                                            uint16_t timerInterruptEnable_TAIE,
                                            uint16_t timerClear);

extern void TIMER_A_configureUpMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TAIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);

extern void TIMER_A_configureUpDownMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerPeriod,
                                        uint16_t timerInterruptEnable_TAIE,
                                        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                        uint16_t timerClear);

extern void TIMER_A_startContinuousMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t timerInterruptEnable_TAIE,
                                        uint16_t timerClear);

extern void TIMER_A_startContinousMode(uint16_t baseAddress,
                                       uint16_t clockSource,
                                       uint16_t clockSourceDivider,
                                       uint16_t timerInterruptEnable_TAIE,
                                       uint16_t timerClear);

extern void TIMER_A_startUpMode(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t timerInterruptEnable_TAIE,
                                uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                uint16_t timerClear);

extern void TIMER_A_startUpDownMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TAIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);

extern void TIMER_A_initCapture(uint16_t baseAddress,
                                uint16_t captureRegister,
                                uint16_t captureMode,
                                uint16_t captureInputSelect,
                                uint16_t synchronizeCaptureSource,
                                uint16_t captureInterruptEnable,
                                uint16_t captureOutputMode);

extern void TIMER_A_initCompare(uint16_t baseAddress,
                                uint16_t compareRegister,
                                uint16_t compareInterruptEnable,
                                uint16_t compareOutputMode,
                                uint16_t compareValue);

extern void TIMER_A_generatePWM(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t timerPeriod,
                                uint16_t compareRegister,
                                uint16_t compareOutputMode,
                                uint16_t dutyCycle);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_TIMER_A_H__
